[Killed] StringLiteral
queroAsCoisasResolvidas/stryker-mocha/src/Calculadora.js:7:14
     switch (operator) {
         case '+':
             return n1 + n2
-        case '-':
+        case "":
             return n1 - n2
         case '*':

[Killed] ObjectLiteral
queroAsCoisasResolvidas/stryker-mocha/src/Calculadora.js:18:18
     }
 }
 
-module.exports = {
-    calcular
-}
+module.exports = {}
