[Killed] BlockStatement
queroAsCoisasResolvidas/stryker-mocha/src/Exceptions.js:1:30
-const exceptions = (type) => {
-    switch (type) {
-        case 'invalid':
-            return 'Deu erro mano - operador inválido'
-        default:
-            return 'caguei'
-    }
-}
+const exceptions = (type) => {}
 
 module.exports = {

[Killed] ConditionalExpression
queroAsCoisasResolvidas/stryker-mocha/src/Exceptions.js:5:9
     switch (type) {
         case 'invalid':
             return 'Deu erro mano - operador inválido'
-        default:
-            return 'caguei'
+        default:
     }
 }
