[Killed] BlockStatement
Documents/stryker-mocha/src/Calculadora.js:3:42
 var { exceptions } = require('./Exceptions') 
 
-const calcular = ({operator, n1, n2}) => {
-    switch (operator) {
-        case '+':
-            return n1 + n2
-        case '-':
-            return n1 - n2
-        case '*':
-            return n1 * n2
-        case '/':
-            return n1/n2
-        default:
-            throw new Error(exceptions('invalid'))
-    }
-}
+const calcular = ({operator, n1, n2}) => {}
 
 module.exports = {

[Killed] ConditionalExpression
Documents/stryker-mocha/src/Calculadora.js:5:9
 
 const calcular = ({operator, n1, n2}) => {
     switch (operator) {
-        case '+':
-            return n1 + n2
+        case '+':
         case '-':
             return n1 - n2

[Killed] StringLiteral
Documents/stryker-mocha/src/Calculadora.js:5:14
 
 const calcular = ({operator, n1, n2}) => {
     switch (operator) {
-        case '+':
+        case "":
             return n1 + n2
         case '-':

[Killed] ArithmeticOperator
Documents/stryker-mocha/src/Calculadora.js:6:20
 const calcular = ({operator, n1, n2}) => {
     switch (operator) {
         case '+':
-            return n1 + n2
+            return n1 - n2
         case '-':
             return n1 - n2

[Killed] ConditionalExpression
Documents/stryker-mocha/src/Calculadora.js:7:9
     switch (operator) {
         case '+':
             return n1 + n2
-        case '-':
-            return n1 - n2
+        case '-':
         case '*':
             return n1 * n2

[Killed] ArithmeticOperator
Documents/stryker-mocha/src/Calculadora.js:8:20
         case '+':
             return n1 + n2
         case '-':
-            return n1 - n2
+            return n1 + n2
         case '*':
             return n1 * n2

[Killed] ConditionalExpression
Documents/stryker-mocha/src/Calculadora.js:9:9
             return n1 + n2
         case '-':
             return n1 - n2
-        case '*':
-            return n1 * n2
+        case '*':
         case '/':
             return n1/n2

[Killed] ArithmeticOperator
Documents/stryker-mocha/src/Calculadora.js:10:20
         case '-':
             return n1 - n2
         case '*':
-            return n1 * n2
+            return n1 / n2
         case '/':
             return n1/n2

[Killed] ConditionalExpression
Documents/stryker-mocha/src/Calculadora.js:11:9
             return n1 - n2
         case '*':
             return n1 * n2
-        case '/':
-            return n1/n2
+        case '/':
         default:
             throw new Error(exceptions('invalid'))

[Killed] ArithmeticOperator
Documents/stryker-mocha/src/Calculadora.js:12:20
         case '*':
             return n1 * n2
         case '/':
-            return n1/n2
+            return n1 * n2
         default:
             throw new Error(exceptions('invalid'))

[Killed] ConditionalExpression
Documents/stryker-mocha/src/Calculadora.js:13:9
             return n1 * n2
         case '/':
             return n1/n2
-        default:
-            throw new Error(exceptions('invalid'))
+        default:
     }
 }
