[Killed] BlockStatement
Documents/stryker-mocha/src/Exceptions.js:1:30
-const exceptions = (type) => {
-    switch (type) {
-        case 'invalid':
-            return 'Deu erro mano - operador inválido'
-        default:
-            return 'Erro default'
-    }
-}
+const exceptions = (type) => {}
 
 module.exports = {

[Killed] ConditionalExpression
Documents/stryker-mocha/src/Exceptions.js:3:9
 const exceptions = (type) => {
     switch (type) {
-        case 'invalid':
-            return 'Deu erro mano - operador inválido'
+        case 'invalid':
         default:
             return 'Erro default'

[Killed] ConditionalExpression
Documents/stryker-mocha/src/Exceptions.js:5:9
     switch (type) {
         case 'invalid':
             return 'Deu erro mano - operador inválido'
-        default:
-            return 'Erro default'
+        default:
     }
 }

[Killed] ObjectLiteral
Documents/stryker-mocha/src/Exceptions.js:10:18
     }
 }
 
-module.exports = {
-    exceptions
-}
+module.exports = {}
